# Pandas Append()

## Pandas append function is used to append rows of other dataframe to the end of the given dataframe, returning a new dataframe object

## syntax: DataFrame.append()

## Parameters: other, ignore_index, sort

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3],
                   'B': [10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [3]:
df2 = pd.DataFrame({'A':[4,5,6],
                   'B': [40,50,60]})
df2

   A   B
0  4  40
1  5  50
2  6  60

In [4]:
df1.append(df2)

# here ignore_index  = False is by default

C:\Users\Nitesh\AppData\Local\Temp\ipykernel_11332\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

   A   B
0  1  10
1  2  20
2  3  30
0  4  40
1  5  50
2  6  60

In [5]:
df1.append(df2, ignore_index = True)

C:\Users\Nitesh\AppData\Local\Temp\ipykernel_11332\2363792934.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2, ignore_index = True)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
5  6  60

In [6]:
df2.append(df1, ignore_index = True)

C:\Users\Nitesh\AppData\Local\Temp\ipykernel_11332\1118020146.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df1, ignore_index = True)

   A   B
0  4  40
1  5  50
2  6  60
3  1  10
4  2  20
5  3  30

In [7]:
df1

   A   B
0  1  10
1  2  20
2  3  30

In [8]:
df3 = pd.DataFrame({'C':[4,5,6],
                   'B': [40,50,60]})
df3

   C   B
0  4  40
1  5  50
2  6  60

In [9]:
df1.append(df3, ignore_index = True)

C:\Users\Nitesh\AppData\Local\Temp\ipykernel_11332\2725901746.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df3, ignore_index = True)

     A   B    C
0  1.0  10  NaN
1  2.0  20  NaN
2  3.0  30  NaN
3  NaN  40  4.0
4  NaN  50  5.0
5  NaN  60  6.0